// Generated by jextract

package com.github.cubiomes;

import java.lang.foreign.Arena;
import java.lang.foreign.GroupLayout;
import java.lang.foreign.MemoryLayout;
import java.lang.foreign.MemorySegment;
import java.lang.foreign.SegmentAllocator;
import java.lang.foreign.SequenceLayout;
import java.lang.invoke.MethodHandle;
import java.util.function.Consumer;

import static java.lang.foreign.MemoryLayout.PathElement.*;
import static java.lang.foreign.ValueLayout.*;

/**
 * {@snippet lang=c :
 * struct SurfaceNoise {
 *     double xzScale;
 *     double yScale;
 *     double xzFactor;
 *     double yFactor;
 *     OctaveNoise octmin;
 *     OctaveNoise octmax;
 *     OctaveNoise octmain;
 *     OctaveNoise octsurf;
 *     OctaveNoise octdepth;
 *     PerlinNoise oct[60];
 * }
 * }
 */
public class SurfaceNoise {

    SurfaceNoise() {
        // Should not be called directly
    }

    private static final GroupLayout $LAYOUT = MemoryLayout.structLayout(
        Cubiomes.C_DOUBLE.withName("xzScale"),
        Cubiomes.C_DOUBLE.withName("yScale"),
        Cubiomes.C_DOUBLE.withName("xzFactor"),
        Cubiomes.C_DOUBLE.withName("yFactor"),
        OctaveNoise.layout().withName("octmin"),
        OctaveNoise.layout().withName("octmax"),
        OctaveNoise.layout().withName("octmain"),
        OctaveNoise.layout().withName("octsurf"),
        OctaveNoise.layout().withName("octdepth"),
        MemoryLayout.sequenceLayout(60, PerlinNoise.layout()).withName("oct")
    ).withName("SurfaceNoise");

    /**
     * The layout of this struct
     */
    public static final GroupLayout layout() {
        return $LAYOUT;
    }

    private static final OfDouble xzScale$LAYOUT = (OfDouble)$LAYOUT.select(groupElement("xzScale"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * double xzScale
     * }
     */
    public static final OfDouble xzScale$layout() {
        return xzScale$LAYOUT;
    }

    private static final long xzScale$OFFSET = 0;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * double xzScale
     * }
     */
    public static final long xzScale$offset() {
        return xzScale$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * double xzScale
     * }
     */
    public static double xzScale(MemorySegment struct) {
        return struct.get(xzScale$LAYOUT, xzScale$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * double xzScale
     * }
     */
    public static void xzScale(MemorySegment struct, double fieldValue) {
        struct.set(xzScale$LAYOUT, xzScale$OFFSET, fieldValue);
    }

    private static final OfDouble yScale$LAYOUT = (OfDouble)$LAYOUT.select(groupElement("yScale"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * double yScale
     * }
     */
    public static final OfDouble yScale$layout() {
        return yScale$LAYOUT;
    }

    private static final long yScale$OFFSET = 8;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * double yScale
     * }
     */
    public static final long yScale$offset() {
        return yScale$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * double yScale
     * }
     */
    public static double yScale(MemorySegment struct) {
        return struct.get(yScale$LAYOUT, yScale$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * double yScale
     * }
     */
    public static void yScale(MemorySegment struct, double fieldValue) {
        struct.set(yScale$LAYOUT, yScale$OFFSET, fieldValue);
    }

    private static final OfDouble xzFactor$LAYOUT = (OfDouble)$LAYOUT.select(groupElement("xzFactor"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * double xzFactor
     * }
     */
    public static final OfDouble xzFactor$layout() {
        return xzFactor$LAYOUT;
    }

    private static final long xzFactor$OFFSET = 16;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * double xzFactor
     * }
     */
    public static final long xzFactor$offset() {
        return xzFactor$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * double xzFactor
     * }
     */
    public static double xzFactor(MemorySegment struct) {
        return struct.get(xzFactor$LAYOUT, xzFactor$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * double xzFactor
     * }
     */
    public static void xzFactor(MemorySegment struct, double fieldValue) {
        struct.set(xzFactor$LAYOUT, xzFactor$OFFSET, fieldValue);
    }

    private static final OfDouble yFactor$LAYOUT = (OfDouble)$LAYOUT.select(groupElement("yFactor"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * double yFactor
     * }
     */
    public static final OfDouble yFactor$layout() {
        return yFactor$LAYOUT;
    }

    private static final long yFactor$OFFSET = 24;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * double yFactor
     * }
     */
    public static final long yFactor$offset() {
        return yFactor$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * double yFactor
     * }
     */
    public static double yFactor(MemorySegment struct) {
        return struct.get(yFactor$LAYOUT, yFactor$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * double yFactor
     * }
     */
    public static void yFactor(MemorySegment struct, double fieldValue) {
        struct.set(yFactor$LAYOUT, yFactor$OFFSET, fieldValue);
    }

    private static final GroupLayout octmin$LAYOUT = (GroupLayout)$LAYOUT.select(groupElement("octmin"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * OctaveNoise octmin
     * }
     */
    public static final GroupLayout octmin$layout() {
        return octmin$LAYOUT;
    }

    private static final long octmin$OFFSET = 32;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * OctaveNoise octmin
     * }
     */
    public static final long octmin$offset() {
        return octmin$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * OctaveNoise octmin
     * }
     */
    public static MemorySegment octmin(MemorySegment struct) {
        return struct.asSlice(octmin$OFFSET, octmin$LAYOUT.byteSize());
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * OctaveNoise octmin
     * }
     */
    public static void octmin(MemorySegment struct, MemorySegment fieldValue) {
        MemorySegment.copy(fieldValue, 0L, struct, octmin$OFFSET, octmin$LAYOUT.byteSize());
    }

    private static final GroupLayout octmax$LAYOUT = (GroupLayout)$LAYOUT.select(groupElement("octmax"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * OctaveNoise octmax
     * }
     */
    public static final GroupLayout octmax$layout() {
        return octmax$LAYOUT;
    }

    private static final long octmax$OFFSET = 48;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * OctaveNoise octmax
     * }
     */
    public static final long octmax$offset() {
        return octmax$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * OctaveNoise octmax
     * }
     */
    public static MemorySegment octmax(MemorySegment struct) {
        return struct.asSlice(octmax$OFFSET, octmax$LAYOUT.byteSize());
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * OctaveNoise octmax
     * }
     */
    public static void octmax(MemorySegment struct, MemorySegment fieldValue) {
        MemorySegment.copy(fieldValue, 0L, struct, octmax$OFFSET, octmax$LAYOUT.byteSize());
    }

    private static final GroupLayout octmain$LAYOUT = (GroupLayout)$LAYOUT.select(groupElement("octmain"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * OctaveNoise octmain
     * }
     */
    public static final GroupLayout octmain$layout() {
        return octmain$LAYOUT;
    }

    private static final long octmain$OFFSET = 64;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * OctaveNoise octmain
     * }
     */
    public static final long octmain$offset() {
        return octmain$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * OctaveNoise octmain
     * }
     */
    public static MemorySegment octmain(MemorySegment struct) {
        return struct.asSlice(octmain$OFFSET, octmain$LAYOUT.byteSize());
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * OctaveNoise octmain
     * }
     */
    public static void octmain(MemorySegment struct, MemorySegment fieldValue) {
        MemorySegment.copy(fieldValue, 0L, struct, octmain$OFFSET, octmain$LAYOUT.byteSize());
    }

    private static final GroupLayout octsurf$LAYOUT = (GroupLayout)$LAYOUT.select(groupElement("octsurf"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * OctaveNoise octsurf
     * }
     */
    public static final GroupLayout octsurf$layout() {
        return octsurf$LAYOUT;
    }

    private static final long octsurf$OFFSET = 80;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * OctaveNoise octsurf
     * }
     */
    public static final long octsurf$offset() {
        return octsurf$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * OctaveNoise octsurf
     * }
     */
    public static MemorySegment octsurf(MemorySegment struct) {
        return struct.asSlice(octsurf$OFFSET, octsurf$LAYOUT.byteSize());
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * OctaveNoise octsurf
     * }
     */
    public static void octsurf(MemorySegment struct, MemorySegment fieldValue) {
        MemorySegment.copy(fieldValue, 0L, struct, octsurf$OFFSET, octsurf$LAYOUT.byteSize());
    }

    private static final GroupLayout octdepth$LAYOUT = (GroupLayout)$LAYOUT.select(groupElement("octdepth"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * OctaveNoise octdepth
     * }
     */
    public static final GroupLayout octdepth$layout() {
        return octdepth$LAYOUT;
    }

    private static final long octdepth$OFFSET = 96;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * OctaveNoise octdepth
     * }
     */
    public static final long octdepth$offset() {
        return octdepth$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * OctaveNoise octdepth
     * }
     */
    public static MemorySegment octdepth(MemorySegment struct) {
        return struct.asSlice(octdepth$OFFSET, octdepth$LAYOUT.byteSize());
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * OctaveNoise octdepth
     * }
     */
    public static void octdepth(MemorySegment struct, MemorySegment fieldValue) {
        MemorySegment.copy(fieldValue, 0L, struct, octdepth$OFFSET, octdepth$LAYOUT.byteSize());
    }

    private static final SequenceLayout oct$LAYOUT = (SequenceLayout)$LAYOUT.select(groupElement("oct"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * PerlinNoise oct[60]
     * }
     */
    public static final SequenceLayout oct$layout() {
        return oct$LAYOUT;
    }

    private static final long oct$OFFSET = 112;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * PerlinNoise oct[60]
     * }
     */
    public static final long oct$offset() {
        return oct$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * PerlinNoise oct[60]
     * }
     */
    public static MemorySegment oct(MemorySegment struct) {
        return struct.asSlice(oct$OFFSET, oct$LAYOUT.byteSize());
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * PerlinNoise oct[60]
     * }
     */
    public static void oct(MemorySegment struct, MemorySegment fieldValue) {
        MemorySegment.copy(fieldValue, 0L, struct, oct$OFFSET, oct$LAYOUT.byteSize());
    }

    private static long[] oct$DIMS = { 60 };

    /**
     * Dimensions for array field:
     * {@snippet lang=c :
     * PerlinNoise oct[60]
     * }
     */
    public static long[] oct$dimensions() {
        return oct$DIMS;
    }
    private static final MethodHandle oct$ELEM_HANDLE = oct$LAYOUT.sliceHandle(sequenceElement());

    /**
     * Indexed getter for field:
     * {@snippet lang=c :
     * PerlinNoise oct[60]
     * }
     */
    public static MemorySegment oct(MemorySegment struct, long index0) {
        try {
            return (MemorySegment)oct$ELEM_HANDLE.invokeExact(struct, 0L, index0);
        } catch (Throwable ex$) {
            throw new AssertionError("should not reach here", ex$);
        }
    }

    /**
     * Indexed setter for field:
     * {@snippet lang=c :
     * PerlinNoise oct[60]
     * }
     */
    public static void oct(MemorySegment struct, long index0, MemorySegment fieldValue) {
        MemorySegment.copy(fieldValue, 0L, oct(struct, index0), 0L, PerlinNoise.layout().byteSize());
    }

    /**
     * Obtains a slice of {@code arrayParam} which selects the array element at {@code index}.
     * The returned segment has address {@code arrayParam.address() + index * layout().byteSize()}
     */
    public static MemorySegment asSlice(MemorySegment array, long index) {
        return array.asSlice(layout().byteSize() * index);
    }

    /**
     * The size (in bytes) of this struct
     */
    public static long sizeof() { return layout().byteSize(); }

    /**
     * Allocate a segment of size {@code layout().byteSize()} using {@code allocator}
     */
    public static MemorySegment allocate(SegmentAllocator allocator) {
        return allocator.allocate(layout());
    }

    /**
     * Allocate an array of size {@code elementCount} using {@code allocator}.
     * The returned segment has size {@code elementCount * layout().byteSize()}.
     */
    public static MemorySegment allocateArray(long elementCount, SegmentAllocator allocator) {
        return allocator.allocate(MemoryLayout.sequenceLayout(elementCount, layout()));
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
     * The returned segment has size {@code layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, Arena arena, Consumer<MemorySegment> cleanup) {
        return reinterpret(addr, 1, arena, cleanup);
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
     * The returned segment has size {@code elementCount * layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, long elementCount, Arena arena, Consumer<MemorySegment> cleanup) {
        return addr.reinterpret(layout().byteSize() * elementCount, arena, cleanup);
    }
}

